In [1]:
# import libraties
import pandas as pd
import numpy as np
import os

In [30]:
#creating path
path = r'/Users/rayruslijunior/11-2021 Instacart Basket Analysis'

In [32]:
# importing orders.csv
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)

In [33]:
#importing products.csv
df_prods=pd.read_csv(r'/Users/rayruslijunior/11-2021 Instacart Basket Analysis/02 Data/Original Data/products.csv',index_col=False)

Data Consistency Check

In [34]:
# First let's take a look at df_ords
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Mixed-Type Data

In [8]:
#create a test dataframe
df_test= pd.DataFrame()

In [9]:
#create a mix column
df_test['mix'] = ['a','b',1,True]

In [35]:
#lets check what is inside our df_test data frame
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [11]:
#function to check if there is a mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [36]:
#after deciding what our collumn should look like
df_test['mix'] = df_test['mix'].astype('str')

Missing Values

In [37]:
#Finding the missing value
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [38]:
#there is a missing value on the product_name aisle

In [39]:
#Creating a new data frame for the missing value on product_name
df_nan=df_prods[df_prods['product_name'].isnull() == True]

In [40]:
#New Data Frame containing only the missing value(NaN)
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

Addressing Missing Value

In [17]:
df_prods.shape

(49693, 5)

In [19]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [20]:
df_prods_clean.shape

(49677, 5)

04. Duplicate

In [41]:
# Look for full duplictates within your data frame
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [22]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [23]:
# Check the number of rows in the prods_clean data frame
df_prods_clean.shape

(49677, 5)

In [26]:
#Drop the duplicate
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [27]:
#Check the number of rows in the data frame without duplicates 
df_prods_clean_no_dups.shape

(49672, 5)

__Task 4.5__

In [46]:
#2. run df.describe() function on df_prods
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

#there seem to be a very unusual price in the price collumn

In [49]:
#3. check for mixed collumn in df_ords
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

#3 & 4 there is no mixed collumn in the df_ords

In [75]:
# run a check for missing value in the df_ords
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [73]:
#dropping eval_set column from orders.csv 
df_ords.drop(columns = ['eval_set'])

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [86]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [83]:
df_ords_nan

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

#5.in a markdown  cell, report your findings and propose an explanation for any missing values you find.

In collumn days_since_prior_order there are 206.209 rows of NaN, a possible explanation to this would be a customer who only submitted one order at the instacart.

#6. Address the missing values using an appropriate method
The correct way here is perhaps to create a new collumn ('first_order' with True/False)to explain the missing value (NaN) in days_since_prior_order.

In [88]:
df_ords_clean = df_ords

In [89]:
df_ords_clean ['first_order'] = df_ords['days_since_prior_order'].isnull() == True

In [91]:
df_ords_clean.head(100)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,first_order
0,2539329,1,prior,1,2,8,NaN,True
1,2398795,1,prior,2,3,7,15.0,False
2,473747,1,prior,3,3,12,21.0,False
3,2254736,1,prior,4,4,7,29.0,False
4,431534,1,prior,5,4,15,28.0,False
...,...,...,...,...,...,...,...,...
95,1468214,11,prior,7,5,9,30.0,False
96,1376945,11,test,8,6,11,8.0,False
97,1483446,12,prior,1,1,12,NaN,True
98,1247527,12,prior,2,5,9,30.0,False
99,1916106,12,prior,3,5,8,14.0,False

#run a check on duplicate value on your clean data set

In [92]:
df_ords_dups = df_ords_clean[df_ords_clean.duplicated()]

In [94]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order, first_order]
Index: []

In [97]:
#8 .address the duplicate using an appropriate method
df_ords_dups.shape

(0, 8)

#there are no duplicate value

#9. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [100]:
#transfering the clean df_prods to csv
df_prods_clean_no_dups.to_csv(os.path.join(path,'02 Data','Prepared Data','products_cleaned.csv'))

In [101]:
#transfering the clean df_ords to csv
df_ords_clean.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_cleaned.csv'))